Обработки/Reports/_ОтчетОДоходахИРасходахСбербанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахСбербанк</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахСбербанк/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Налоговый регистр Доходы, расходы и налоговая база от размещения пенсионных резервов",
		"0.24",
		"",
		Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Руководитель	= НастройкиОтчета.ПодписантРуководитель;
	ЭтотОбъект.Подписант	= НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПодписантРуководитель");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("ПодписантОтКлиента");

	Возврат Настройки;

КонецФункции

Функция РасчетНКДКорпоративные20()
	
	// взято _CводныйРегистрБУиНУРосинфоком
	// запрос обрезан для налогового учета и корпоративных 20%
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ _ЦБ
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|				И ВЫРАЗИТЬ(ЦеннаяБумага КАК Справочник.Облигации).Категория В (&Корпоративные)) КАК БухПартииЦенныхБумагОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.КоличествоОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(КотировкиТорговыхПлощадокСводныеСрезПоследних.WAPRICE_DATE) КАК WAPRICE_DATE,
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ _КотировкиСрез
	|ИЗ
	|	РегистрСведений.КотировкиТорговыхПлощадокСводные.СрезПоследних(
	|			&НачалоПериода,
	|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|				И Биржа = &ММВБ
	|				И НЕ РежимТоргов.РЕПО
	|				И НЕ РежимТоргов.ПервичноеРазмещение
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_ЦБ.ЦеннаяБумага КАК ЦеннаяБумага
	|					ИЗ
	|						_ЦБ КАК _ЦБ)) КАК КотировкиТорговыхПлощадокСводныеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиТорговыхПлощадокСводныеСрезПоследних.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ВидУчета КАК ВидУчета,
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
	|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Категория КАК ЦеннаяБумагаКатегория,
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ДатаНачалаРазмещения КАК ДатаНачалаРазмещения,
	|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупонаВВалютеУчетаОстаток,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток КАК СтоимостьКупонаВВалютеУчетаОстаток,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток / БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК НДК3112,
	|	КупонныйДоходПоОблигациям.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	_КотировкиСрез.WAPRICE_DATE КАК WAPRICE_DATE
	|ПОМЕСТИТЬ _Остатки3112
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_ЦБ.ЦеннаяБумага КАК ЦеннаяБумага
	|					ИЗ
	|						_ЦБ КАК _ЦБ)) КАК БухПартииЦенныхБумагОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям КАК КупонныйДоходПоОблигациям
	|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = КупонныйДоходПоОблигациям.Облигация
	|			И (КупонныйДоходПоОблигациям.ДатаОкончанияКупона >= &НачалоПериода)
	|			И (ДОБАВИТЬКДАТЕ(КупонныйДоходПоОблигациям.ДатаОкончанияКупона, ДЕНЬ, -КупонныйДоходПоОблигациям.Срок) < &НачалоПериода)
	|			И (КупонныйДоходПоОблигациям.Облигация В
	|				(ВЫБРАТЬ
	|					_ЦБ.ЦеннаяБумага КАК ЦеннаяБумага
	|				ИЗ
	|					_ЦБ КАК _ЦБ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиСрез КАК _КотировкиСрез
	|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = _КотировкиСрез.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА _Остатки3112.ЦеннаяБумагаКатегория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная))
	|			ТОГДА ВЫБОР
	|					КОГДА _Остатки3112.ДатаНачалаРазмещения >= ДАТАВРЕМЯ(2017, 1, 1)
	|							И _Остатки3112.WAPRICE_DATE >= ДОБАВИТЬКДАТЕ(&Дата3112, МЕСЯЦ, -3)
	|						ТОГДА ""Корп15""
	|					ИНАЧЕ ""Корп20""
	|				КОНЕЦ
	|		ИНАЧЕ ""Гос""
	|	КОНЕЦ КАК Категория,
	|	_Остатки3112.КоличествоОстаток КАК Количество3112,
	|	_Остатки3112.ПереоценкаКупонаВВалютеУчетаОстаток КАК ПереоценкаКупона3112,
	|	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	БухПартииЦенныхБумагОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	БухПартииЦенныхБумагОстаткиИОбороты.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор.Дата, ДЕНЬ) КАК РегистраторДата,
	|	НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстаткиИОбороты.Партия.Дата, ДЕНЬ) КАК ДатаПартии,
	|	_Остатки3112.НДК3112 КАК НДК3112,
	|	_Остатки3112.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) = ТИП(Документ.Сделка)
	|				ИЛИ ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
	|			ТОГДА БухПартииЦенныхБумагОстаткиИОбороты.КоличествоРасход * _Остатки3112.НДК3112
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПродажа,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор.Дата, ДЕНЬ) = _Остатки3112.ДатаОкончанияКупона
	|				И ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
	|			ТОГДА БухПартииЦенныхБумагОстаткиИОбороты.КоличествоНачальныйОстаток * _Остатки3112.НДК3112
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПогашение,
	|	БухПартииЦенныхБумагОстаткиИОбороты.Регистратор КАК Регистратор,
	|	БухПартииЦенныхБумагОстаткиИОбороты.Партия КАК Партия,
	|	БухПартииЦенныхБумагОстаткиИОбороты.СтрокаПартии КАК СтрокаПартии
	|ПОМЕСТИТЬ _Данные
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Движения,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
	|				И Партия.Дата < &НачалоПериода
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						_ЦБ.ЦеннаяБумага КАК ЦеннаяБумага
	|					ИЗ
	|						_ЦБ КАК _ЦБ)
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)) КАК БухПартииЦенныхБумагОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Остатки3112 КАК _Остатки3112
	|		ПО БухПартииЦенныхБумагОстаткиИОбороты.ВидУчета = _Остатки3112.ВидУчета
	|			И БухПартииЦенныхБумагОстаткиИОбороты.ЦеннаяБумага = _Остатки3112.ЦеннаяБумага
	|			И БухПартииЦенныхБумагОстаткиИОбороты.Партия = _Остатки3112.Партия
	|			И БухПартииЦенныхБумагОстаткиИОбороты.СтрокаПартии = _Остатки3112.СтрокаПартии
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиИОбороты.Регистратор) <> ТИП(Документ.ПереоценкаЦенныхБумаг)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(_Данные.СуммаПродажа), 0) КАК СуммаПродажа,
	|	ЕСТЬNULL(СУММА(_Данные.СуммаПогашение), 0) КАК СуммаПогашение
	|ПОМЕСТИТЬ _Итог
	|ИЗ
	|	_Данные КАК _Данные
	|ГДЕ
	|	_Данные.Категория = ""Корп20""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Данные.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Данные.КоличествоРасход КАК КоличествоРасход,
	|	_Данные.ПереоценкаКупонаВВалютеУчетаРасход КАК ПереоценкаКупонаВВалютеУчетаРасход,
	|	_Данные.РегистраторДата КАК РегистраторДата,
	|	_Данные.ДатаПартии КАК ДатаПартии,
	|	_Данные.НДК3112 КАК НДК3112,
	|	_Данные.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	_Данные.СуммаПродажа КАК СуммаПродажа,
	|	_Данные.СуммаПогашение КАК СуммаПогашение,
	|	_Данные.Регистратор КАК Регистратор,
	|	_Данные.Партия КАК Партия,
	|	_Данные.СтрокаПартии КАК СтрокаПартии
	|ПОМЕСТИТЬ _Расшифровка
	|ИЗ
	|	_Данные КАК _Данные
	|ГДЕ
	|	_Данные.Категория = ""Корп20""
	|	И (_Данные.СуммаПродажа > 0
	|			ИЛИ _Данные.СуммаПогашение > 0)";
	
	Запрос.УстановитьПараметр("Дата3112", НачалоГода(ЭтотОбъект.Период.ДатаНачала)-1);
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ММВБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	КатегорииКорпоративные = Новый Массив;
	КатегорииКорпоративные.Добавить(Перечисления.КатегорииОблигаций.Корпоративная);
	КатегорииКорпоративные.Добавить(Перечисления.КатегорииОблигаций.Ипотечная);
	КатегорииКорпоративные.Добавить(Перечисления.КатегорииОблигаций.Еврооблигация);
	Запрос.УстановитьПараметр("Корпоративные", КатегорииКорпоративные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаИтог = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Итог").ПолучитьДанные().Выгрузить();
	ТаблицаРасшифровка = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Расшифровка").ПолучитьДанные().Выгрузить();
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТаблицаИтог", ТаблицаИтог);
	ВозвращаемоеЗначение.Вставить("ТаблицаРасшифровкиК20", ТаблицаРасшифровка);
	
	Возврат ВозвращаемоеЗначение;
		
КонецФункции	

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка)	Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант,Руководитель,ПодписантОтКлиента");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);	
		
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;	
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	
	МакетНастройка = ПолучитьМакет("Настройка");
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
		
	Если ТаблицаНастройки.Количество() = 0 Тогда
		
		Сообщить("Отсутствует настройка для отчета");
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
		Возврат;
		
	КонецЕсли;	
	
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "ПрочиеДоходы", "ПрочиеРасходы", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы, Ложь);
	
	// посчитаем НКД корп 20%, погашеныей и проданый по цене 31.12 прошлого года
	ДанныеНКД_20 = РасчетНКДКорпоративные20();
	ТаблицаИтог = ДанныеНКД_20.ТаблицаИтог;
	
	ЗначениеНКДКорп7 = 0;
	ЗначениеНКДКорп20_7 = 0;
	Для Каждого СтрИтог Из ТаблицаИтог Цикл
		ЗначениеНКДКорп7 = СтрИтог.СуммаПродажа;
		ЗначениеНКДКорп20_7 = СтрИтог.СуммаПогашение;		
	КонецЦикла;	
	
	Если ОбластиИЗначения.Свойство("НКДКорп20Начисление") Тогда
		ОбластиИЗначения.НКДКорп20Начисление = ОбластиИЗначения.НКДКорп20Начисление + ЗначениеНКДКорп7 + ЗначениеНКДКорп20_7;
	Иначе 
		ОбластиИЗначения.Вставить("НКДКорп20Начисление", ЗначениеНКДКорп7 + ЗначениеНКДКорп20_7);
	КонецЕсли;
	
	Если ОбластиИЗначения.Свойство("НКДКорп7") Тогда
		ОбластиИЗначения.НКДКорп7 = ОбластиИЗначения.НКДКорп7 + ЗначениеНКДКорп7;
	Иначе 
		ОбластиИЗначения.Вставить("НКДКорп7", ЗначениеНКДКорп7);
	КонецЕсли;
	
	Если ОбластиИЗначения.Свойство("НКДКорп20_7") Тогда
		ОбластиИЗначения.НКДКорп20_7 = ОбластиИЗначения.НКДКорп20_7 + ЗначениеНКДКорп20_7;
	Иначе 
		ОбластиИЗначения.Вставить("НКДКорп20_7",  ЗначениеНКДКорп20_7);
	КонецЕсли;	
	
	ОбщиеФункции.РасчетИтогов(ТаблицаНастройки, ОбластиИЗначения);
	
	//прочие доходы, если есть занулим
	ОбластиИЗначения.Вставить("ПрочиеДоходы",  0);
	ОбластиИЗначения.Вставить("ПрочиеДоходы4",  0);
	ОбластиИЗначения.Вставить("ПрочиеДоходы10",  0);
	
	//вывод формы
	Отчет = ПолучитьМакет("Отчет");
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	
	ОбластьОтчет.Параметры.Заполнить(ПараметрыШапки);
	ОбластьОтчет.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьОтчет.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	//показатели
	ОбщиеФункции.ЗаполнениеОбластиЗначениями(ОбластьОтчет, ОбластиИЗначения); 	
	ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеДоходыСтр", ОбластьОтчет, Отчет, ПрочиеДоходы);
	ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеРасходыСтр", ОбластьОтчет, Отчет, ПрочиеРасходы);	
	
	//Подписи	
	ДанныеПодписантов = ПолучитьПараметрыПодписантов(Подписант, Руководитель, ПодписантОтКлиента);
	
	Если ЗначениеЗаполнено(Руководитель) Тогда 
		ОбластьОтчет.Параметры.ДолжностьРуководитель = ДанныеПодписантов.ДолжностьРуководителя;
		ОбластьОтчет.Параметры.Руководитель =  ДанныеПодписантов.ПодписантРуководитель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено( Подписант) Тогда 
		ОбластьОтчет.Параметры.ДолжностьГлавБух = ДанныеПодписантов.Должность;
		ОбластьОтчет.Параметры.Ответственный = ДанныеПодписантов.Подписант ;
	КонецЕсли;
	
	Если ЗначениеЗаполнено( ПодписантОтКлиента) Тогда 
		ОбластьОтчет.Параметры.ДолжностьПодписантОтКлиента = ДанныеПодписантов.ДолжностьКонтактноеЛицоКлиента;
		ОбластьОтчет.Параметры.ПодписантОтКлиента = ДанныеПодписантов.ПодписантКлиента ;
	КонецЕсли;	
			
	ДокументРезультат.Вывести(ОбластьОтчет);	
	
	КлючПараметровПечати = "ОтчетОФинрезультатахСбербанк";
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, КлючПараметровПечати, , ОриентацияСтраницы.Портрет);		
	
	ПечатьРасшифровки(ПолучитьМакет("Расшифровка"), ДокументРасшифровка, ТабРасшифровки, ДанныеНКД_20.ТаблицаРасшифровкиК20);
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), Истина, ОриентацияСтраницы.Портрет);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры	

Функция ПолучитьПараметрыПодписантов(Подписант, ПодписантРуководитель, КонтактноеЛицоКлиента)
	
	Данные = Новый Структура;
	
	Если ЗначениеЗаполнено(Подписант) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Ответственный",	Подписант);
		
		Запрос.Текст =
		#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий,
		|	КонтактныеЛица.КонтактноеЛицо.Наименование КАК Ответственный
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	(КонтактныеЛица.Подразделение, КонтактныеЛица.Язык, КонтактныеЛица.Объект, КонтактныеЛица.КонтактноеЛицо) В
		|			(ВЫБРАТЬ
		|				ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) КАК Подразделение,
		|				ЗНАЧЕНИЕ(Справочник.Языки.Русский) КАК Язык,
		|				Организации.ЮрФизЛицо КАК Объект,
		|				&Ответственный КАК КонтактноеЛицо
		|			ИЗ
		|				Справочник.Организации КАК Организации
		|			ГДЕ
		|				Организации.Ссылка = &Организация)";
		#КонецОбласти
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Данные.Вставить("Должность", Выборка.Должность + ?(ЗначениеЗаполнено(Выборка.ОснованиеПолномочий), " (на основании " + Выборка.ОснованиеПолномочий + ")", ""));
			Данные.Вставить("Подписант", Выборка.Ответственный);
		Иначе
			Данные.Вставить("Должность","");
			Данные.Вставить("Подписант", Подписант);
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодписантРуководитель) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Ответственный",	ПодписантРуководитель);
		
		Запрос.Текст =
		#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий,
		|	КонтактныеЛица.КонтактноеЛицо.Наименование КАК Ответственный
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	(КонтактныеЛица.Подразделение, КонтактныеЛица.Язык, КонтактныеЛица.Объект, КонтактныеЛица.КонтактноеЛицо) В
		|			(ВЫБРАТЬ
		|				ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) КАК Подразделение,
		|				ЗНАЧЕНИЕ(Справочник.Языки.Русский) КАК Язык,
		|				Организации.ЮрФизЛицо КАК Объект,
		|				&Ответственный КАК КонтактноеЛицо
		|			ИЗ
		|				Справочник.Организации КАК Организации
		|			ГДЕ
		|				Организации.Ссылка = &Организация)";
		#КонецОбласти
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Данные.Вставить("ДолжностьРуководителя", Выборка.Должность + ?(ЗначениеЗаполнено(Выборка.ОснованиеПолномочий), " (на основании " + Выборка.ОснованиеПолномочий + ")", ""));
			Данные.Вставить("ПодписантРуководитель", Выборка.Ответственный);
		Иначе
			Данные.Вставить("ДолжностьРуководителя","");
			Данные.Вставить("ПодписантРуководитель", ПодписантРуководитель);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактноеЛицоКлиента) Тогда
			
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Период",	ЭтотОбъект.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Ответственный",	"%"+ СокрЛП(КонтактноеЛицоКлиента)+"%");
		
		Запрос.Текст =
		#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.КонтактноеЛицо КАК Ответственный,
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.Клиент = КонтактныеЛица.Объект
		|			И (КонтактныеЛица.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И (ТИПЗНАЧЕНИЯ(КонтактныеЛица.КонтактноеЛицо) = ТИП(СТРОКА))
		|			И (КонтактныеЛица.КонтактноеЛицо ПОДОБНО &Ответственный)";
		#КонецОбласти
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Данные.Вставить("ДолжностьКонтактноеЛицоКлиента", Выборка.Должность); 
			Данные.Вставить("ПодписантКлиента", Выборка.Ответственный);
		Иначе
			Данные.Вставить("ДолжностьКонтактноеЛицоКлиента","");
			Данные.Вставить("ПодписантКлиента", КонтактноеЛицоКлиента);
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции


Процедура ПечатьРасшифровки(Макет, ДокументРасшифровка, РабочаяТаблица, ТаблицаРасшифровкиК20)  Экспорт
		
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	ДокументРасшифровка.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТаблицаИтоги = РабочаяТаблица.Скопировать();
	ТаблицаИтоги.Свернуть("СтрокаОтчета", "СуммаОборотКт, СуммаОборотДт");
	
	Для Каждого СтрИтог из ТаблицаИтоги Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, СтрИтог);
		ОбластьИтог.Параметры.СтрокаОтчета = ОбластьИтог.Параметры.СтрокаОтчета;
		ДокументРасшифровка.Вывести(ОбластьИтог);
		
		Отбор = Новый Структура;
		Отбор.Вставить("СтрокаОтчета", СтрИтог.СтрокаОтчета);
		
		МассивСтрок = РабочаяТаблица.НайтиСтроки(Отбор);
		
		ДокументРасшифровка.НачатьГруппуСтрок(, Ложь);
		Для Каждого СтрокаРасшифровка из МассивСтрок Цикл 		
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаРасшифровка);			
			ДокументРасшифровка.Вывести(ОбластьСтрока);
		КонецЦикла;	
		ДокументРасшифровка.ЗакончитьГруппуСтрок();
		
	КонецЦикла;	
	
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ДокументРасшифровка.Вывести(ОбластьШапка2);
	ОбластьИтог2 = Макет.ПолучитьОбласть("Итог2");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	
	ДокументРасшифровка.НачатьГруппуСтрок(, Ложь);
	Для Каждого СтрРасшифровка из  ТаблицаРасшифровкиК20 Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, СтрРасшифровка);
		ДокументРасшифровка.Вывести(ОбластьДанные);
	КонецЦикла;	
	ДокументРасшифровка.ЗакончитьГруппуСтрок();

	
	ОбластьИтог2.Параметры.СуммаПродажа = ТаблицаРасшифровкиК20.Итог("СуммаПродажа");
	ОбластьИтог2.Параметры.СуммаПогашение = ТаблицаРасшифровкиК20.Итог("СуммаПогашение");
	ДокументРасшифровка.Вывести(ОбластьИтог2);
	
			
КонецПроцедуры

Процедура ПроверкаНастроек(ДокументРезультат)	Экспорт
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	МакетНастройка = ПолучитьМакет("Настройка");	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);	

	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	ВидыУчета = Новый Массив;
	ВидыУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
		
	Параметры = Новый Структура;
	Параметры.Вставить("ВидыУчета", ВидыУчета);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("ОтчетнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("НачальнаяДата", ЭтотОбъект.Период.ДатаНачала);
	
	ОбщиеФункции.ПроверкаНастроек(ДокументРезультат, ТаблицаНастройки, Параметры);
		
КонецПроцедуры
